<template>
  <div>
    <h1>문화재 인기순</h1>
    <ol>
      <li v-for="dummyData in dummyDatas" :key="dummyData">
        <h2>{{ dummyData.k_name }}</h2>
        {{ dummyData.h_name }}
        <button>좋아요</button>
        <button>북마크</button>
        <button>공유</button>
      </li>
    </ol>
  </div>
</template>

<script>
export default {
  name: "HomeHeritage",
  data() {
    return {
      dummyDatas: {
        14860000: {
          selnum: "14860000",
          k_name: "이광사 초상",
          h_name: "李匡師 肖像",
          clsfc_code: "12",
          clsfc_name: "보물",
          longitude: "126.980350241652",
          latitude: "37.5240413763397",
          content:
            "李匡師(1705-1777)는 원교체를 완성하고 동국진체를 이룩한 조선시대 대표적 서예가 중 한 사람이다. <이광사 초상> 화면 우상단에 ‘朝鮮國光山李公諱匡師字道甫圓嶠先生遺像 … 此本卽 先生七十歲甲午冬畵師申漢枰所寫……’라고 쓰여 있어 이 작품의 주인공과 제작시기, 화가 등 내력을 알 수 있다. 기록을 토대로 1775년에 이광사 말년의 모습을 신윤복의 아버지로 유명한 화원화가 신한평이 그린 것임이 확인된다.\n   전체적으로 섬세하고 우아한 필묘와 은근한 요철감을 표현하는 수법으로 강렬하지는 않지만 품격 있고 깊은 傳神을 성취하였다는 점에서 수준이 높은 역작이다. 또한 신한평이 초상으로 유명하였지만 전해지는 작품이 없다는 점에서도 이 작품은 희귀한 가치를 지니고 있다. \n  ㅇ 규격(세로x가로) : 66.8 x 53.7cm",
          imageURL:
            "http://www.cha.go.kr/unisearch/images/treasure/1614874.jpg",
          era: "1775년",
          address: "서울특별시 용산구 서빙고로 137 (용산동6가, 국립중앙박물관)",
        },
        14870000: {
          selnum: "14870000",
          k_name: "서직수 초상",
          h_name: "徐直修 肖像",
          clsfc_code: "12",
          clsfc_name: "보물",
          longitude: "126.980350241652",
          latitude: "37.5240413763397",
          content:
            "서직수(1735-?)는 본관은 達城이며, 자는 敬之, 호는 十友軒이다. 영의정 서명균의 조카로서, 진사로 관직에 있지 않고 일생을 시서화를 하면서 보냈다한다. <서직수초상> 화면의 오른 편 상단에는 서직수의 自贊이 있어 서직수 62세인 1796년 당대 최고의 초상화가인 이명기가 얼굴을 그리고 김홍도가 몸체를 그린 합작품임을 알 수 있다.   \n   <서직수초상>은 동파관에 도포를 입고 흑색 광다회를 두르고, 버선발로 서 있는 좌안8분면의 전신입상이다. 조선시대 초상화의 대부분이 좌상인데 반해 입상(그 것도 실내장면)일 뿐더러, 당대 최고화가들의 합작이라는 점 등에서 중요성을 지닌다. 그리고 매우 뛰어난 형태 묘사와 투시법, 명암법을 구사하면서도 높은 품격을 보여주어 정조대 초상화의 백미로 꼽히는 걸작이다.\n  ㅇ 규격(세로x가로) : 148.8x72cm",
          imageURL:
            "http://www.cha.go.kr/unisearch/images/treasure/1614875.jpg",
          era: "1796년",
          address: "서울특별시 용산구 서빙고로 137 (용산동6가, 국립중앙박물관)",
        },
        14880000: {
          selnum: "14880000",
          k_name: "심득경 초상",
          h_name: "沈得經 肖像",
          clsfc_code: "12",
          clsfc_name: "보물",
          longitude: "126.883091194016",
          latitude: "35.1890949671163",
          content:
            "심득경(沈得經 1673-1710)의 본관은 청송(靑松)이며 자세한 행적은 전하지 않는다. 이 초상은 동파관에 유복 차림을 하고 의자에 앉아 있는 좌안칠분면 전신좌상이다. 화면 상단에 “定齋處士沈公眞”이라고 예서로 쓰여 있다. 그리고 우측 상단에는 이서 (李漵 1662-1723 )가 지은 찬을 윤두서(尹斗緖 1668-1715)가 썼으며, 왼쪽 상단에 다시 이서의 찬이 적혀있다. 그리고 우측 아래쪽에 “維 王三十六年庚寅十一月寫時 公歿後第四月也海南尹斗緖謹齋心寫”라고 쓰여 있어 윤두서가 숙종36년인 1710년 11월에 추화(追畵)한 것임을 알 수 있다.\n  얼굴이나 의복의 묘사는 다소 과장과 형식화가 엿보이고 있어서 사실적 묘사로서의 초상화의 특징과 유형화된 표현을 위주로 하는 일반 인물화의 요소를 함께 지니고 있다고 할 수 있다. 남태응(南泰膺)의 '청죽화사(靑竹畵史)'에 이 초상에 대하여 적혀있는데 친구 심득경이 죽은 후 윤두서가 그의 초상을 그리니 심득경 가족들이 이를 보고 모두 울었다고 전한다. \n  조선후기 대표적 문인화가인 윤두서가 그린 초상화로서 의미가 크며 회화성도 높은 중요한 작품이다.  \n ㅇ 규격(세로x가로) : 160.3x87.7cm",
          imageURL:
            "http://www.cha.go.kr/unisearch/images/treasure/1615510.jpg",
          era: "1710년",
          address:
            "광주 북구 하서로 110, 국립광주박물관 (매곡동,국립광주박물관)",
        },
      },
    };
  },
};
</script>

<style>
</style>